In [10]:
from pandas import Series, DataFrame
import pandas as pd

## Cargar el Archivo CSV "ejemplo" con la libreria pandas y visualizar su contenido (Archivo Adjunto en la Tarjeta de Trello):

In [15]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## Cargar el Archivo Excel "Excel_Sample.xlsx" (archivo Adjunto en la Tarjeta de Trello) y visualizar su contenido (Utilizando la libreria Pandas):

In [17]:
arc= pd.read_excel("Excel_Sample.xlsx")
arc

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

## Crea un DataFrame de Pandas con los siguientes Datos e imprimelos en pantalla:

In [27]:
data={"Nombre":["Carmen","Pedro","Maria","Julio"],
      "Edad":[26,39,28,35],
      "Genero":["F","M","F","M"],
      "Id":[1743,9264,8362,2537]}
DT=pd.DataFrame(data,index=[" "," "," "," "])
DT

   Nombre  Edad Genero    Id
   Carmen    26      F  1743
    Pedro    39      M  9264
    Maria    28      F  8362
    Julio    35      M  2537

## Crear nuevamente otro DataFrame, pero ahora con los siguientes datos

In [28]:
data2={"Nombre":["Gabriela","Carlos","Samuel","Jhon"],
      "Edad":[27,36,22,29],
      "Genero":["F","M","M","M"],
      "Id":[1736,3524,9837,7367]}
DT2=pd.DataFrame(data2,index=[" "," "," "," "])
DT2

     Nombre  Edad Genero    Id
   Gabriela    27      F  1736
     Carlos    36      M  3524
     Samuel    22      M  9837
       Jhon    29      M  7367

## Combina los 2 dataframes anteriores en uno solo e imprimelos en pantalla:

In [29]:
DT3= pd.concat([DT,DT2])
DT3

     Nombre  Edad Genero    Id
     Carmen    26      F  1743
      Pedro    39      M  9264
      Maria    28      F  8362
      Julio    35      M  2537
   Gabriela    27      F  1736
     Carlos    36      M  3524
     Samuel    22      M  9837
       Jhon    29      M  7367